
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/terraform-for-container-operation/actions/runs/5706963691)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-for-api]
data.aws_iam_policy_document.ecs_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075058cf3c293747f]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-for-api]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3adca757c7a29b2]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d451342d3cfc463c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0aadae0bd723083b6]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ad7a27af85265202]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0393c7a160030dccf]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0159c63a097a933ae]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-045e7a4287d60f218]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0110bf1fc9c4088c2]
aws_security_group.ecs: Refreshing state... [id=sg-0ac74d3a206d70d04]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/go-for-api-target-group/7beb819d5c6a8417]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ca36752b1b4ca25b]
aws_security_group.alb: Refreshing state... [id=sg-0302e3d2b024b00f0]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08ba86b00c36d4b2a]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c3f487829a2e1587]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-094be487cdd8dc310]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03ad33c2a0995ef02]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/go-for-api-alb/ca621acff5f672b2]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-586569237]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-020770d2bf0cce94b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0110bf1fc9c4088c21080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0854cdc54210a818e]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fd749b24ca4fea4b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-047bd52bbcf806376]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-082ec01efead41866]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03c7ba16c4f55b0a1]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3adca757c7a29b21080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ad7a27af852652021080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/go-for-api-alb/ca621acff5f672b2/6a595fa8f421ceb8]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/go-for-api-alb/ca621acff5f672b2/6a595fa8f421ceb8/2c11cb06da83f8ae]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/go-for-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-for-api"
      + tags_all = (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-for-api"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-for-api"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/go-for-api-target-group/7beb819d5c6a8417"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0ac74d3a206d70d04",
            ]
          + subnets          = [
              + "subnet-0c3f487829a2e1587",
              + "subnet-0ca36752b1b4ca25b",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-for-api"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-for-api"
                        }
                    }
                  + name             = "go-for-api"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-for-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-for-api-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-for-api-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_basic will be created
  + resource "aws_iam_role_policy_attachment" "ecs_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-for-api-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs_task: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs: Creation complete after 0s [id=go-for-api-ecs]
aws_iam_role.ecs_task: Creation complete after 0s [id=go-for-api-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Creating...
aws_iam_role_policy_attachment.ecs_basic: Creation complete after 0s [id=go-for-api-ecs-20230730151635035500000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-for-api]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 0s [id=go-for-api]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 11s [id=arn:aws:ecs:ap-northeast-1:113713103169:cluster/go-for-api]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:113713103169:service/go-for-api/go-for-api]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":8,"Program":"tfcmt","SHA1":"6ff147bd7086105e01463771bac5e540c99d4044","Vars":{},"WorkflowName":"Terraform"} -->